schreibfaul1/ESP32-audioI2S/src/Audio.cpp
/*
 * Audio.cpp
 *
 *  Created on: Oct 27.2018
 *
 *  Version 3.0.12k
 *  Updated on: Aug 26.2024
 *      Author: Wolle (schreibfaul1)
 *
 */
#include "Audio.h"
#ifndef AUDIO_I2S_DISABLE_AAC_DECODER
    #include "aac_decoder/aac_decoder.h"
#endif
#ifndef AUDIO_I2S_DISABLE_FLAC_DECODER
    #include "flac_decoder/flac_decoder.h"
#endif
#ifndef AUDIO_I2S_DISABLE_MP3_DECODER
    #include "mp3_decoder/mp3_decoder.h"
#endif
#ifndef AUDIO_I2S_DISABLE_OPUS_DECODER
    #include "opus_decoder/opus_decoder.h"
#endif
#ifndef AUDIO_I2S_DISABLE_VORBIS_DECODER
    #include "vorbis_decoder/vorbis_decoder.h"
#endif

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
AudioBuffer::AudioBuffer(size_t maxBlockSize) {
    mutex_buffer = xSemaphoreCreateRecursiveMutex();
    // if maxBlockSize isn't set use defaultspace (1600 bytes) is enough for aac and mp3 player
    if(maxBlockSize) m_resBuffSizeRAM = maxBlockSize;
    if(maxBlockSize) m_maxBlockSize = maxBlockSize;
}

AudioBuffer::~AudioBuffer() {
    if(m_buffer) free(m_buffer);
    m_buffer = NULL;
    vSemaphoreDelete(mutex_buffer);
}

void AudioBuffer::setBufsize(int ram, int psram) {
    if(ram > -1) // -1 == default / no change
        m_buffSizeRAM = ram;
    if(psram > -1) m_buffSizePSRAM = psram;
}

int32_t AudioBuffer::getBufsize() { return m_buffSize; }

size_t AudioBuffer::init() {
    if(m_buffer) free(m_buffer);
    m_buffer = NULL;
    if(psramInit() && m_buffSizePSRAM > 0) {
        // PSRAM found, AudioBuffer will be allocated in PSRAM
        m_f_psram = true;
        m_buffSize = m_buffSizePSRAM;
        m_buffer = (uint8_t*)ps_calloc(m_buffSize, sizeof(uint8_t));
        m_buffSize = m_buffSizePSRAM - m_resBuffSizePSRAM;
    }
    if(m_buffer == NULL) {
        // PSRAM not found, not configured or not enough available
        m_f_psram = false;
        m_buffer = (uint8_t*)heap_caps_calloc(m_buffSizeRAM, sizeof(uint8_t), MALLOC_CAP_DEFAULT | MALLOC_CAP_INTERNAL);
        m_buffSize = m_buffSizeRAM - m_resBuffSizeRAM;
    }
    if(!m_buffer) return 0;
    m_f_init = true;
    resetBuffer();
    return m_buffSize;
}

void AudioBuffer::changeMaxBlockSize(uint16_t mbs) {
    m_maxBlockSize = mbs;
    return;
}

uint16_t AudioBuffer::getMaxBlockSize() { return m_maxBlockSize; }

size_t AudioBuffer::freeSpace() {
    if(m_readPtr == m_writePtr) {
        if(m_f_start) m_freeSpace = m_buffSize;
        else m_freeSpace = 0;
    }
    if(m_readPtr < m_writePtr) {
        m_freeSpace = (m_endPtr - m_writePtr + 1) + (m_readPtr - m_buffer);
    }
    if(m_readPtr > m_writePtr) {
        m_freeSpace = m_readPtr - m_writePtr;
    }
    return m_freeSpace;
}

size_t AudioBuffer::writeSpace() {
    xSemaphoreTakeRecursive(mutex_buffer, 3 * configTICK_RATE_HZ);
    if(m_readPtr == m_writePtr) {
        if(m_f_start) m_writeSpace = m_endPtr - m_writePtr + 1;
        else m_writeSpace = 0;
    }
    if(m_readPtr < m_writePtr) {
        m_writeSpace = m_endPtr - m_writePtr + 1;
    }
    if(m_readPtr > m_writePtr) {
        m_writeSpace = m_readPtr - m_writePtr ;
    }
    xSemaphoreGiveRecursive(mutex_buffer);
    return m_writeSpace;
}

size_t AudioBuffer::bufferFilled() {
    xSemaphoreTakeRecursive(mutex_buffer, 3 * configTICK_RATE_HZ);
    if(m_readPtr == m_writePtr) {
        if(m_f_start) m_dataLength = 0;
        else m_dataLength = (m_endPtr - m_readPtr + 1) + (m_writePtr - m_buffer);
    }
    if(m_readPtr < m_writePtr) {
        m_dataLength = m_writePtr - m_readPtr;
    }
    if(m_readPtr > m_writePtr) {
        m_dataLength = (m_endPtr - m_readPtr + 1) + (m_writePtr - m_buffer);
    }
    xSemaphoreGiveRecursive(mutex_buffer);
    return m_dataLength;
}

size_t AudioBuffer::getMaxAvailableBytes() {
    xSemaphoreTakeRecursive(mutex_buffer, 3 * configTICK_RATE_HZ);
    if(m_readPtr == m_writePtr) {
        if(m_f_start)m_dataLength = 0;
        else m_dataLength = (m_endPtr - m_readPtr + 1) + (m_writePtr - m_buffer);
    }
    if(m_readPtr < m_writePtr) {
        m_dataLength = m_writePtr - m_readPtr;
    }
    if(m_readPtr > m_writePtr) {
        m_dataLength = (m_endPtr - m_readPtr + 1);
    }
    xSemaphoreGiveRecursive(mutex_buffer);
    return m_dataLength;
}

void AudioBuffer::bytesWritten(size_t bw) {
    xSemaphoreTakeRecursive(mutex_buffer, 3 * configTICK_RATE_HZ);
    m_writePtr += bw;
    if(m_writePtr == m_endPtr + 1) { m_writePtr = m_buffer; }
    if(m_writePtr > m_endPtr + 1) log_e("m_writePtr %i, m_endPtr %i", m_writePtr, m_endPtr);
    if(bw && m_f_start) m_f_start = false;
    xSemaphoreGiveRecursive(mutex_buffer);
}

void AudioBuffer::bytesWasRead(size_t br) {
    xSemaphoreTakeRecursive(mutex_buffer, 3 * configTICK_RATE_HZ);
    m_readPtr += br;
    if(m_readPtr >= m_endPtr) {
        size_t tmp = m_readPtr - m_endPtr;
        m_readPtr = m_buffer + tmp - 1;
    }
    xSemaphoreGiveRecursive(mutex_buffer);
}

uint8_t* AudioBuffer::getWritePtr() { return m_writePtr; }

uint8_t* AudioBuffer::getReadPtr() {
    xSemaphoreTakeRecursive(mutex_buffer, 3 * configTICK_RATE_HZ);
    int32_t len = m_endPtr - m_readPtr;
    if(len < m_maxBlockSize) {                            // be sure the last frame is completed
        memcpy(m_endPtr + 1, m_buffer, m_maxBlockSize - (len  - 1)); // cpy from m_buffer to m_endPtr with len
    }
    xSemaphoreGiveRecursive(mutex_buffer);
    return m_readPtr;
}

void AudioBuffer::resetBuffer() {
    m_writePtr = m_buffer;
    m_readPtr = m_buffer;
    m_endPtr = m_buffer + m_buffSize;
    m_f_start = true;
    // memset(m_buffer, 0, m_buffSize); //Clear Inputbuffer
    vSemaphoreDelete(mutex_buffer);
    mutex_buffer = xSemaphoreCreateRecursiveMutex(); // free semaphore is it set
}

uint32_t AudioBuffer::getWritePos() { return m_writePtr - m_buffer; }

uint32_t AudioBuffer::getReadPos() { return m_readPtr - m_buffer; }
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// clang-format off
Audio::Audio(bool internalDAC /* = false */, uint8_t channelEnabled /* = I2S_SLOT_MODE_STEREO */, uint8_t i2sPort) {

