schreibfaul1/ESP32-audioI2S/src/Audio.cpp
        m_controlCounter = M4A_OKAY; // that's all
        return 0;
    }
    // this section should never be reached
    log_e("error");
    return 0;
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
size_t Audio::process_m3u8_ID3_Header(uint8_t* packet) {
    uint8_t  ID3version;
    size_t   id3Size;
    bool     m_f_unsync = false, m_f_exthdr = false;
    uint64_t current_timestamp = 0;

    (void)m_f_unsync;        // suppress -Wunused-variable
    (void)current_timestamp; // suppress -Wunused-variable

    if(specialIndexOf(packet, "ID3", 4) != 0) { // ID3 not found
        if(m_f_Log) log_i("m3u8 file has no mp3 tag");
        return 0; // error, no ID3 signature found
    }
    ID3version = *(packet + 3);
    switch(ID3version) {
        case 2:
            m_f_unsync = (*(packet + 5) & 0x80);
            m_f_exthdr = false;
            break;
        case 3:
        case 4:
            m_f_unsync = (*(packet + 5) & 0x80); // bit7
            m_f_exthdr = (*(packet + 5) & 0x40); // bit6 extended header
            break;
    };
    id3Size = bigEndian(&packet[6], 4, 7); //  ID3v2 size  4 * %0xxxxxxx (shift left seven times!!)
    id3Size += 10;
    if(m_f_Log) log_i("ID3 framesSize: %i", id3Size);
    if(m_f_Log) log_i("ID3 version: 2.%i", ID3version);

    if(m_f_exthdr) {
        log_e("ID3 extended header in m3u8 files not supported");
        return 0;
    }
    if(m_f_Log) log_i("ID3 normal frames");

    if(specialIndexOf(&packet[10], "PRIV", 5) != 0) { // tag PRIV not found
        log_e("tag PRIV in m3u8 Id3 Header not found");
        return 0;
    }
    // if tag PRIV exists assume content is "com.apple.streaming.transportStreamTimestamp"
    // a time stamp is expected in the header.

    current_timestamp = (double)bigEndian(&packet[69], 4) / 90000; // seconds

    return id3Size;
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint32_t Audio::stopSong() {
    uint32_t pos = 0;
    if(m_f_running) {
        m_f_running = false;
        if(getDatamode() == AUDIO_LOCALFILE) {
            m_streamType = ST_NONE;
            pos = getFilePos() - inBufferFilled();
        }
        if(_client->connected()) _client->stop();
    }
    if(audiofile) {
        // added this before putting 'm_f_localfile = false' in stopSong(); shoulf never occur....
        AUDIO_INFO("Closing audio file \"%s\"", audiofile.name());
        audiofile.close();
    }
    memset(m_outBuff, 0, m_outbuffSize); // Clear OutputBuffer
    memset(m_filterBuff, 0, sizeof(m_filterBuff)); // Clear FilterBuffer
    m_validSamples = 0;
    m_audioCurrentTime = 0;
    m_audioFileDuration = 0;
    m_codec = CODEC_NONE;

    return pos;
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
bool Audio::pauseResume() {
    xSemaphoreTake(mutex_playAudioData, portMAX_DELAY);
    bool retVal = false;
    if(getDatamode() == AUDIO_LOCALFILE || m_streamType == ST_WEBSTREAM || m_streamType == ST_WEBFILE) {
        m_f_running = !m_f_running;
        retVal = true;
        if(!m_f_running) {
            memset(m_outBuff, 0, m_outbuffSize); // Clear OutputBuffer
            m_validSamples = 0;
        }
    }
    xSemaphoreGive(mutex_playAudioData);
    return retVal;
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Audio::playChunk() {

    int16_t validSamples = 0;
    static uint16_t count = 0;
    size_t i2s_bytesConsumed = 0;
    int16_t* sample[2] = {0};
    int16_t* s2;
    int sampleSize = (m_bitsPerSample / 8);
    esp_err_t err = ESP_OK;
    int i= 0;

    count = 0;
    if(m_bitsPerSample == 8){
        int16_t s16_1 = 0;
        int16_t s16_2 = 0;

        validSamples = m_validSamples; // double validsamples, make stereo
        while(validSamples){
            s16_1 = (m_outBuff[validSamples - 1] & 0xFF00);
            s16_2 = (m_outBuff[validSamples - 1] & 0x00FF) << 8;
            m_outBuff[validSamples * 2 - 1] = s16_1 - 0x8000;
            m_outBuff[validSamples * 2 - 2] = s16_2 - 0x8000;
            validSamples--;
        }
        if(getChannels() == 1) m_validSamples *= 4;
        else                   m_validSamples *= 2;
    }

    if(m_channels == 1){
        if(m_outbuffSize < m_validSamples * 2){
            log_e("valid samples: %i greater than buffer size: %i", m_outbuffSize, m_validSamples);
            m_validSamples = m_outbuffSize / 2; // avoid buffer overrun
        }
        int s16 = 0;
        validSamples = m_validSamples; // double validsamples, make stereo
        while(validSamples){
            s16 = m_outBuff[validSamples - 1];
            m_outBuff[validSamples * 2 - 1] = s16;
            m_outBuff[validSamples * 2 - 2] = s16;
            validSamples --;
        }
        m_validSamples *= 2;
    }

    validSamples = m_validSamples;

    while(validSamples) {
        *sample = m_outBuff + i;

        computeVUlevel(*sample);

        //---------- Filterchain, can commented out if not used-------------
        {
            if(m_corr > 1) {
                s2 = *sample;
                s2[LEFTCHANNEL] /= m_corr;
                s2[RIGHTCHANNEL] /= m_corr;
            }
            IIR_filterChain0(*sample);
            IIR_filterChain1(*sample);
            IIR_filterChain2(*sample);
        }
        //------------------------------------------------------------------
        Gain(*sample);
        if(m_f_internalDAC) {
            s2 = *sample;
            s2[LEFTCHANNEL] += 0x8000;
            s2[RIGHTCHANNEL] += 0x8000;
        }
        i += m_bitsPerSample == 16 ? 2 : 1;
        validSamples -= 1;
    }
    if(audio_process_i2s) {
        // processing the audio samples from external before forwarding them to i2s
        bool continueI2S = false;
        audio_process_i2s((int16_t*)m_outBuff, m_validSamples, m_bitsPerSample, m_channels, &continueI2S);
        if(!continueI2S) {
            m_validSamples = 0;
            count = 0;
            return;
        }
    }

    validSamples = m_validSamples;


#if(ESP_IDF_VERSION_MAJOR == 5)
    err = i2s_channel_write(m_i2s_tx_handle, (int16_t*)m_outBuff + count, validSamples * (sampleSize * m_channels), &i2s_bytesConsumed, 160);
#else
    err = i2s_write((i2s_port_t)m_i2s_num, (int16_t*)m_outBuff + count, validSamples * (sampleSize * m_channels), &i2s_bytesConsumed, 160);
#endif

