schreibfaul1/ESP32-audioI2S/src/Audio.cpp
    if(m_resumeFilePos >= 0) {
        if(m_resumeFilePos <  (int32_t)m_audioDataStart) m_resumeFilePos = m_audioDataStart;
        if(m_resumeFilePos >= (int32_t)m_audioDataStart + m_audioDataSize) {goto exit;}
        m_haveNewFilePos = m_resumeFilePos;

        if(m_codec == CODEC_M4A) {
            m_resumeFilePos = m4a_correctResumeFilePos(m_resumeFilePos);
        }
        if(m_codec == CODEC_WAV) {
            while((m_resumeFilePos % 4) != 0){ // must be divisible by four
                m_resumeFilePos++;
                if(m_resumeFilePos >= m_fileSize) goto exit;
            }
        }
#ifndef AUDIO_I2S_DISABLE_FLAC_DECODER
        if(m_codec == CODEC_FLAC) {
            m_resumeFilePos = flac_correctResumeFilePos(m_resumeFilePos);
            if(m_resumeFilePos == -1) goto exit;
            FLACDecoderReset();
        }
#endif
#ifndef AUDIO_I2S_DISABLE_MP3_DECODER
        if(m_codec == CODEC_MP3) {
            m_resumeFilePos = mp3_correctResumeFilePos(m_resumeFilePos);
            if(m_resumeFilePos == -1) goto exit;
        }
#endif

        audiofile.seek(m_resumeFilePos);
        InBuff.resetBuffer();
        byteCounter = m_resumeFilePos;
        f_fileDataComplete = false; // #570

        m_resumeFilePos = -1;
        m_f_stream = false;
    }
    // end of file reached? - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(f_fileDataComplete && InBuff.bufferFilled() < InBuff.getMaxBlockSize()) {
        if(InBuff.bufferFilled()) {
            if(!readID3V1Tag()) {
                if(m_validSamples) {
                    return;
                }
            }
        }

        if(m_f_loop && m_f_stream) {                                                                                      // eof
            AUDIO_INFO("loop from: %lu to: %lu", (long unsigned int)getFilePos(), (long unsigned int)m_audioDataStart); // loop
            setFilePos(m_audioDataStart);
#ifndef AUDIO_I2S_DISABLE_FLAC_DECODER
            if(m_codec == CODEC_FLAC) FLACDecoderReset();
#endif
            m_audioCurrentTime = 0;
            byteCounter = m_audioDataStart;
            f_fileDataComplete = false;
            return;
        } // loop
exit:
        char* afn = NULL;
        if(audiofile) afn = strdup(audiofile.name()); // store temporary the name
        m_f_running = false;
        m_streamType = ST_NONE;
        audiofile.close();
        AUDIO_INFO("Closing audio file \"%s\"", afn);

#ifndef AUDIO_I2S_DISABLE_MP3_DECODER
        if(m_codec == CODEC_MP3) MP3Decoder_FreeBuffers();
#endif
#ifndef AUDIO_I2S_DISABLE_AAC_DECODER
        if(m_codec == CODEC_AAC) AACDecoder_FreeBuffers();
        if(m_codec == CODEC_M4A) AACDecoder_FreeBuffers();
#endif
#ifndef AUDIO_I2S_DISABLE_FLAC_DECODER
        if(m_codec == CODEC_FLAC) FLACDecoder_FreeBuffers();
#endif
#ifndef AUDIO_I2S_DISABLE_OPUS_DECODER
        if(m_codec == CODEC_OPUS) OPUSDecoder_FreeBuffers();
#endif
#ifndef AUDIO_I2S_DISABLE_VORBIS_DECODER
        if(m_codec == CODEC_VORBIS) VORBISDecoder_FreeBuffers();
#endif

        if(afn) {
            if(audio_eof_mp3) audio_eof_mp3(afn);
            AUDIO_INFO("End of file \"%s\"", afn);
            free(afn);
            afn = NULL;
        }
        m_audioCurrentTime = 0;
        m_audioFileDuration = 0;
        m_resumeFilePos = -1;
        m_haveNewFilePos = 0;
        m_codec = CODEC_NONE;
        return;
    }
    if(byteCounter == audiofile.size()) { f_fileDataComplete = true; }
    if(byteCounter == m_audioDataSize + m_audioDataStart) { f_fileDataComplete = true; }
}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Audio::processWebStream() {
    const uint16_t  maxFrameSize = InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
    static uint32_t chunkSize;                               // chunkcount read from stream

    // first call, set some values to default  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(m_f_firstCall) { // runs only ont time per connection, prepare for start
        m_f_firstCall = false;
        m_f_stream = false;
        chunkSize = 0;
        m_metacount = m_metaint;
        readMetadata(0, true); // reset all static vars
    }

    if(getDatamode() != AUDIO_DATA) return;         // guard
    uint32_t availableBytes = _client->available(); // available from stream
    // chunked data tramsfer - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(m_f_chunked && availableBytes) {
        uint8_t readedBytes = 0;
        if(!chunkSize) chunkSize = chunkedDataTransfer(&readedBytes);
        availableBytes = min(availableBytes, chunkSize);
    }
    // we have metadata  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(m_f_metadata && availableBytes) {
        if(m_metacount == 0) {
            chunkSize -= readMetadata(availableBytes);
            return;
        }
        availableBytes = min(availableBytes, m_metacount);
    }

    // if the buffer is often almost empty issue a warning - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(m_f_stream) {
        if(streamDetection(availableBytes)) return;
    }

    // buffer fill routine - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(availableBytes) {
        availableBytes = min(availableBytes, (uint32_t)InBuff.writeSpace());
        int16_t bytesAddedToBuffer = _client->read(InBuff.getWritePtr(), availableBytes);

        if(bytesAddedToBuffer > 0) {
            if(m_f_metadata) m_metacount -= bytesAddedToBuffer;
            if(m_f_chunked) chunkSize -= bytesAddedToBuffer;
            InBuff.bytesWritten(bytesAddedToBuffer);
        }

        if(InBuff.bufferFilled() > maxFrameSize && !m_f_stream) { // waiting for buffer filled
            m_f_stream = true;                                    // ready to play the audio data
            AUDIO_INFO("stream ready");
        }
        if(!m_f_stream) return;
        if(m_codec == CODEC_OGG) { // log_i("determine correct codec here");
            uint8_t codec = determineOggCodec(InBuff.getReadPtr(), maxFrameSize);
            if(codec == CODEC_FLAC) {
                m_codec = CODEC_FLAC;
                initializeDecoder();
                return;
            }
            if(codec == CODEC_OPUS) {
                m_codec = CODEC_OPUS;
                initializeDecoder();
                return;
            }
            if(codec == CODEC_VORBIS) {
                m_codec = CODEC_VORBIS;
                initializeDecoder();
                return;
            }
            stopSong();
            return;
        }
    }

